Repository: vengi-voxel/vengi
Catalog: data/shared/*.po
Languages: de_de

source: Redo
de_de: Wiederherstellen

source: Cut
de_de: Ausschneiden

source: Paste at reference
de_de: Einfügen an Referenzposition

source: Paste at cursor
de_de: Einfügen an Cursorposition

source: Paste as new node
de_de: Als neuen Knoten einfügen

source: Paste as stamp
de_de: Als Stempel einfügen

source: Color picker
de_de: Farbauswahl

source: Color wheel
de_de: Farbrad

source: Model animation speed
de_de: Modellanimationsgeschwindigkeit

source: Autosave delay in seconds
de_de: Automatische Speicherverzögerung in Sekunden

source: Viewports
de_de: Ansichten

source: Zoom speed
de_de: Zoom-Geschwindigkeit

source: View distance
de_de: Sichtweite

source: Reset layout
de_de: Layout zurücksetzen

source: Select
de_de: Auswählen

source: Invert
de_de: Invertieren

source: All
de_de: Alles

source: Welcome screen
de_de: Willkommensbildschirm

source: User name
de_de: Benutzername

source: Disconnect
de_de: Trennen

source: Max connections
de_de: Maximale Verbindungen

source: Stop server
de_de: Stoppe Server

source: Start Server
de_de: Starte Server

source: Tools
de_de: Werkzeuge

source: To transform
de_de: Zu Transform

source: Convert the region offset into the keyframe transforms
de_de: Wandeln Sie die Position der Region in die Keyframe-Transformationen um

source: Region sizes
de_de: Regionengrößen

source: Interpolation details
de_de: Interpolationsdetails

source: Reset transforms
de_de: Transform resetten

source: Mirror X
de_de: Spiegelung X

source: Mirror Y
de_de: Spiegelung Y

source: Mirror XZ
de_de: Spiegelung XZ

source: Mirror XYZ
de_de: Spiegelung XYZ

source: Local transforms
de_de: Lokale Transformationen

source: Update children
de_de: Kinder aktualisieren

source: Auto Keyframe
de_de: Automatischer Keyframe

source: Translation
de_de: Verschiebung

source: Rotation
de_de: Drehung

source: Scale
de_de: Skalierung

source: Delete this node property
de_de: Diese Knoteneigenschaft löschen

source: Add a new node property
de_de: Neue Knoteneigenschaft hinzufügen

source: Node Inspector
de_de: Knoteninspektor

source: Volume Inspector
de_de: Volumeninspektor

source: Node Properties
de_de: Knoteneigenschaften

source: Export
de_de: Exportieren

source: Auto normals
de_de: Auto Normalen

source: Normal mode
de_de: Normalen Modus

source: Recalculate all normals
de_de: All Normalen neu berechnen

source: Model is hollow
de_de: Modell ist hohl

source: Fill hollows to re-calculate the normals and hollow the model afterwards again. For calculating normals it is needed that the model has a closed surface and the hollow area is filled. Either do it manually or activate this option.
de_de: Hohlräume füllen, um die Normalen neu zu berechnen und das Modell danach wieder auszuhöhlen. Für die Berechnung der Normalen ist es notwendig, dass das Modell eine geschlossene Oberfläche hat und der hohle Bereich gefüllt ist. Entweder manuell durchführen, oder diese Option aktivieren.

source: Calculate normals
de_de: Normalen berechnen

source: Calculate normals for the model
de_de: Normalen für das Modell berechnen

source: Remove all normals
de_de: All Normalen entfernen

source: Normal index: %i (scene normal index %i)
de_de: Normalenindex: %i (Szene-Normalenindex %i)

source: Render normals
de_de: Voxelnormalen rendern

source: Normal
de_de: Normale

source: Rotate 90 deg
de_de: Um 90 Grad drehen

source: Remove alpha
de_de: Alpha entfernen

source: Model from color
de_de: Modell aus Farbe

source: Duplicate color
de_de: Farbe duplizieren

source: Remove color
de_de: Farbe entfernen

source: Reduce to selected
de_de: Auf Auswahl reduzieren

source: Release CTRL to change the voxel color
de_de: Lassen Sie die STRG-Taste los, um die Voxel-Farbe zu ändern

source: Press CTRL to re-order
de_de: Drücken Sie STRG, um die Reihenfolge zu ändern

source: Empty color slot
de_de: Leerer Farbslot

source: Select Palette
de_de: Palette auswählen

source: Select the palette
de_de: Wähle die Palette aus

source: To add your own palettes here, put a palette-name.png into one of the search directories or load it into any node to appear here.
de_de: Um Ihre eigenen Paletten hier hinzuzufügen, legen Sie eine palette-name.png in einen der Suchverzeichnisse oder laden Sie sie in einen beliebigen Knoten, um sie hier anzuzeigen.

source: Color match
de_de: Farbabgleich

source: Adopt the current voxels to the best fitting colors of the new palette.
de_de: Passen Sie die aktuellen Voxel an die am besten passenden Farben der neuen Palette an.

source: Import
de_de: Importieren

source: Switch
de_de: Wechseln

source: Export the palette
de_de: Die Palette exportieren

source: Sort
de_de: Sortieren

source: Hue
de_de: Farbton

source: Saturation
de_de: Sättigung

source: Brightness
de_de: Helligkeit

source: Remove unused color
de_de: Unbenutzte Farbe entfernen

source: Remove and re-create palette
de_de: Palette entfernen und neu erstellen

source: Apply to all nodes
de_de: Auf alle Knoten anwenden

source: Warmer
de_de: Wärmer

source: Colder
de_de: Kälter

source: Brighter
de_de: Aufhellen

source: Darker
de_de: Abdunkeln

source: Color closest match
de_de: Nächste Farbe

source: Select a color to find the closest match in the current loaded palette
de_de: Wählen Sie eine Farbe aus, um die nächstgelegene Übereinstimmung in der aktuellen geladenen Palette zu finden

source: Palette index: %i (scene voxel index %i)
de_de: Palettenindex: %i (Szene-Voxelindex %i)

source: Save image
de_de: Bild speichern

source: Stop path tracer
de_de: Pfadverfolgung stoppen

source: Sample %i / %i
de_de: Beispiel %i / %i

source: Start path tracer
de_de: Pfadverfolgung starten

source: Render Settings
de_de: Rendereinstellungen

source: Dimensions
de_de: Dimensionen

source: The number of per-pixel samples used while rendering and is the only parameter used to control the tradeoff between noise and speed.
de_de: Die Anzahl der pro Pixel verwendeten Samples während des Renderings und ist der einzige Parameter, der den Kompromiss zwischen Rauschen und Geschwindigkeit steuert.

source: The maximum number of bounces and should be high for scenes with glass and volumes, but otherwise a low number would suffice.
de_de: Die maximale Anzahl der Bounces sollte hoch sein für Szenen mit Glas und Volumen, aber ansonsten reicht eine niedrige Zahl aus.

source: Remove high-energy fireflies
de_de: Hochenergetische Glühwürmchen entfernen

source: Preview ratio
de_de: Vorschauverhältnis

source: Batch
de_de: Stapel

source: Hide environment
de_de: Umgebung ausblenden

source: Removes the environment map from the camera rays.
de_de: Entfernt die Umgebungskarte von den Kamerarays.

source: Apply a linear filter to the image pixels
de_de: Wendet einen linearen Filter auf die Bildpixel an

source: High Quality BVH
de_de: Hochwertige BVH (Bounding Volume Hierarchy)

source: Denoise
de_de: Rauschunterdrückung

source: Reset all
de_de: Alles zurücksetzen

source: High quality
de_de: Hohe Qualität

source: Geometry preview
de_de: Geometrie-Vorschau

source: Scene insights
de_de: Szeneninterna

source: Pending meshes: %i
de_de: Ausstehende Meshes: %u

source: Rename
de_de: Umbenennen

source: Show all
de_de: Alle anzeigen

source: Hide all
de_de: Alle ausblenden

source: Hide others
de_de: Andere ausblenden

source: Lock all
de_de: Alle sperren

source: Unlock all
de_de: Alle entsperren

source: Duplicate
de_de: Duplizieren

source: Create reference
de_de: Referenz erstellen

source: Merge
de_de: Zusammenführen

source: Use as stamp
de_de: Als Stempel verwenden

source: Merge all
de_de: Alle zusammenführen

source: Merge visible
de_de: Sichtbare zusammenführen

source: Merge locked
de_de: Gesperrte zusammenführen

source: Center origin
de_de: Ursprung zentrieren

source: Center reference
de_de: Referenz zentrieren

source: Convert to model
de_de: In Modell umwandeln

source: Use this camera
de_de: Benutze diese Kamera

source: Save all
de_de: Alle speichern

source: Add new group
de_de: Neue Gruppe hinzufügen

source: Add new point
de_de: Neuen Punkt hinzufügen

source: Disabled because inactive nodes are hidden and the active node is always visible
de_de: Deaktiviert, da inaktive Knoten ausgeblendet werden und der aktive Knoten immer sichtbar ist

source: Reference Node
de_de: Referenzknoten

source: Reference Target Node
de_de: Zielknoten der Referenz

source: Delete this model
de_de: Dieses Modell löschen

source: Scene
de_de: Szene

source: Add a new model node
de_de: Neuen Modellknoten hinzufügen

source: Add a new group
de_de: Neue Gruppe hinzufügen

source: Remove the active node with all its children
de_de: Den aktiven Knoten mit allen seinen Kindern entfernen

source: Cameras
de_de: Kameras

source: Groups
de_de: Gruppen

source: Points
de_de: Punkte

source: References
de_de: Referenzknoten

source: Merge onto
de_de: Zusammenführen auf

source: Merge %s onto %s
de_de: %s auf %s zusammenführen

source: Move below
de_de: Unterhalb verschieben

source: Ambient color
de_de: Umgebungslichtfarbe

source: Diffuse color
de_de: Diffuse Farbe

source: Sun angle
de_de: Sonnenwinkel

source: Scene settings
de_de: Szene-Einstellungen

source: Scripts
de_de: Skripte

source: Create a new lua script
de_de: Ein neues LUA-Skript erstellen

source: Edit script
de_de: Skript bearbeiten

source: Edit the selected lua script
de_de: Das ausgewählte LUA-Skript bearbeiten

source: Reload
de_de: Neu laden

source: Scripting manual
de_de: Skripting-Handbuch

source: Script Editor
de_de: Skripteditor

source: Overwrite scripts/%s
de_de: Skripte/%s überschreiben

source: Select all
de_de: Alles auswählen

source: Grayscale
de_de: Graustufen

source: Only active
de_de: Nur aktiv

source: Grid size
de_de: Rastergröße

source: Command: %s
de_de: Befehl: %s

source: Command: %s (%s)
de_de: Befehl: %s (%s)

source: Switch between scene and edit mode (not in simple UI mode) by pressing the <cmd:togglescene> key.
de_de: Zwischen Szenen- und Bearbeitungsmodus wechseln (nicht im einfachen UI Modus), indem Sie die <cmd:togglescene>-Taste drücken.

source: Use the file dialog options for format specific options.
de_de: Verwenden Sie die Dateidialogoptionen für formatabhängige Optionen.

source: You can record a video of your rotating model in the viewport by using the 'View' menu and the 'Video' option. Make sure to set the camera rotation speed to e.g. 1.
de_de: Sie können ein Video Ihres rotierenden Modells in der Ansicht erstellen, indem Sie das Menü 'Ansicht' und die Option 'Video' verwenden. Stellen Sie sicher, dass Sie die Kamerarotationsgeschwindigkeit z. B. auf 1 einstellen.

source: When saving to a foreign format you might lose scene details if the format doesn't support particular features. Make sure to use the vengi format for highest compatibility.
de_de: Beim Speichern in einem fremden Format können Szenendetails verloren gehen, wenn das Format bestimmte Funktionen nicht unterstützt. Verwenden Sie für höchste Kompatibilität das Vengi-Format.

source: Change the color reduction mode to improve the quality of the palette especially for importing RGBA or mesh based formats.
de_de: Ändern Sie den Farbreduktionsmodus, um die Qualität der Palette zu verbessern, insbesondere beim Import von RGBA- oder meshbasierten Formaten.

source: Drag a model from the assets panel to the stamp brush to use it.
de_de: Ziehen Sie ein Modell aus dem Asset-Panel auf den Stempel-Pinsel, um es zu verwenden.

source: You can reset the camera simply by pressing <cmd:resetcamera>.
de_de: Sie können die Kamera einfach durch Drücken von <cmd:resetcamera> zurücksetzen.

source: The editor shows the last executed console command in the status bar. You can use these commands and bind them to keys.
de_de: Der Editor zeigt den zuletzt ausgeführten Konsolenbefehl in der Statusleiste an. Sie können diese Befehle verwenden und ihnen Tasten zuweisen.

source: You can switch the camera scene movement by switching the 'Camera movement' to 'Eye' or 'Target' in the 'View' menu of the viewport or by pressing <cmd:cam_rotation>.
de_de: Sie können die Szenenbewegung im WASD-Stil aktivieren, indem Sie die 'Kamerabewegung' im 'Ansicht'-Menü der Ansicht auf 'Auge' umschalten.

source: In order to use the path modifier, you have to place the reference position on top of another voxel and place the end of the path on another existing and connected voxel.
de_de: Um den Pfadmodifikator zu verwenden, müssen Sie die Referenzposition auf einem anderen Voxel platzieren und das Ende des Pfads auf einem anderen vorhandenen und verbundenen Voxel platzieren.

source: When importing meshes, you can switch between different voxelization methods in the options menu.
de_de: Beim Importieren von Meshes können Sie im Optionsmenü zwischen verschiedenen Voxelisierungsmethoden wechseln.

source: Delete voxels in edit mode by pressing <cmd:+actionexecutedelete> or by using the erase modifier.
de_de: Löschen Sie Voxel im Bearbeitungsmodus, indem Sie <cmd:+actionexecutedelete> drücken oder den Löschmodifikator verwenden.

source: Switch between different color themes in the options menu.
de_de: Wechseln Sie im Optionsmenü zwischen verschiedenen Farbthemen.

source: Please activate anonymous usage metrics in the options or the about dialog.
de_de: Bitte aktivieren Sie anonyme Nutzungsstatistiken in den Optionen oder im Info-Dialog.

source: You can change your default key bindings to Magicavoxel, Blender, Qubicle or Vengi own style. Check the bindings window in the options menu.
de_de: Sie können Ihre Standard-Tastenbelegungen auf den Magicavoxel-, Blender-, Qubicle- oder Vengi-eigenen Stil ändern. Überprüfen Sie das Bindungsfenster im Optionsmenü.

source: You can save your viewport as AVI video or as screenshot.
de_de: Sie können Ihre Ansicht als AVI-Video oder als Screenshot speichern.

source: Press <cmd:pickcolor> to pick a color from the scene.
de_de: Drücken Sie <cmd:pickcolor>, um eine Farbe aus der Szene auszuwählen.

source: Press <cmd:mirroraxisshapebrushx>, <cmd:mirroraxisshapebrushy> or <cmd:mirroraxisshapebrushz> to mirror the current selection.
de_de: Drücken Sie <cmd:mirroraxisshapebrushx>, <cmd:mirroraxisshapebrushy> oder <cmd:mirroraxisshapebrushz>, um die aktuelle Auswahl zu spiegeln.

source: Rotate by 90 degree on the x axis
de_de: Um 90 Grad um die x-Achse drehen

source: Rotate by 90 degree on the y axis
de_de: Um 90 Grad um die y-Achse drehen

source: Rotate by 90 degree on the z axis
de_de: Um 90 Grad um die z-Achse drehen

source: Flip on axis
de_de: Auf Achse umdrehen

source: Move voxels
de_de: Voxel verschieben

source: Distance
de_de: Entfernung

source: Gizmo settings
de_de: Gizmo-Einstellungen

source: Rotate
de_de: Drehen

source: Activate the rotate operation
de_de: Die Drehoperation aktivieren

source: Translate
de_de: Verschieben

source: Activate the translate operation
de_de: Die Verschiebeoperation aktivieren

source: Snap to grid
de_de: Am Raster ausrichten

source: Flip axis
de_de: Achse umkehren

source: Simple
de_de: Einfach

source: Loading
de_de: Laden

source: Lines
de_de: Linien

source: Solid
de_de: Voll

source: Render mode
de_de: Rendermodus

source: Stop recording
de_de: Aufnahme stoppen

source: Pending frames: %u
de_de: Ausstehende Frames: %u

source: You can control the fps of the video with the cvar %s Pending frames: %u
de_de: Sie können die Bildrate des Videos mit der cvar %s steuern Ausstehende Frames: %u

source: View
de_de: Ansicht

source: Reset camera
de_de: Kamera zurücksetzen

source: Scene Mode
de_de: Szenenmodus

source: Apply transforms
de_de: Transformationen anwenden

source: EditMode
de_de: Bearbeitungsmodus

source: SceneMode
de_de: Szenenmodus

source: Create a reference node
de_de: Referenzknoten erstellen

source: Use the color wheel in the palette color editing
de_de: Verwenden Sie das Farbrad zur Bearbeitung der Farben in der Palette

source: Always show the color picker below the palette
de_de: Den Farbwähler immer unterhalb der Palette anzeigen

source: Milliseconds that a region should get highlighted in a few situations
de_de: Millisekunden, in denen eine Region in bestimmten Situationen hervorgehoben werden sollte

source: Use local space for transforms
de_de: Lokalen Raum für Transformationen verwenden

source: Show the grid
de_de: Gitter anzeigen

source: Show the currently locked axis
de_de: Aktuell gesperrte Achse anzeigen

source: Show the axis aligned bounding box
de_de: Achsenorientierte Begrenzungsbox anzeigen

source: Show the bones in scene mode
de_de: Knochen im Szenenmodus anzeigen

source: Render with shadows - make sure to set the scene lighting up properly
de_de: Mit Schatten rendern - stellen Sie sicher, dass die Szenenbeleuchtung richtig eingestellt ist

source: Millisecond delay between frames hide/unhide when using the scene graph panel play button to animate the models in the scene
de_de: Millisekunden Verzögerung zwischen dem Ein- und Ausblenden von Frames beim Verwenden der Wiedergabetaste im Szenengraphen-Panel, um die Modelle in der Szene zu animieren

source: The size of the voxel grid
de_de: Die Größe des Voxelgitters

source: The size of the plane
de_de: Die Größe der Ebene

source: Show the plane
de_de: Ebene anzeigen

source: Render the inactive nodes in gray scale mode
de_de: Die inaktiven Knoten in grau darstellen

source: Hide the inactive nodes
de_de: Alle inaktiven Knoten ausblenden

source: Show the axis
de_de: Achsen anzeigen

source: Automatically create keyframes when changing transforms
de_de: Automatisch Keyframes erstellen, wenn sich Transformationen ändern

source: Bitmask of gizmo operations in scene mode
de_de: Bitmaske der Gizmo-Operationen im Szenenmodus

source: Activate the pivot mode for the gizmo in scene mode
de_de: Aktiviere den Pivot-Modus für das Gizmo im Szenenmodus

source: Flip axis or stay along the positive world/local axis
de_de: Achse umkehren oder entlang der positiven Welt-/Lokalachse bleiben

source: Use the grid size for snap
de_de: Verwende die Rastergröße für das Einrasten

source: Show the gizmo to also translate the region
de_de: Zeige das Gizmo, um auch die Region zu verschieben

source: The amount of viewports (not in simple ui mode)
de_de: Die Anzahl der Ansichtsbereiche (nicht im einfachen UI-Modus)

source: The maximum size of the preview volume
de_de: Die maximale Größe des Vorschauvolumens

source: Show the tip of the day on startup
de_de: Zeige den Tipp des Tages beim Start

source: Trigger opening of popup
de_de: Öffnen des Popups auslösen

source: Update the children of a node when the transform of the node changes
de_de: Aktualisiere die Kinder eines Knotens, wenn sich die Transformation des Knotens ändert

source: Delay in second between autosaves - 0 disables autosaves
de_de: Verzögerung in Sekunden zwischen den automatischen Speicherungen - 0 deaktiviert automatische Speicherungen

source: Resize the volume to the current selection
de_de: Das Volumen auf die aktuelle Auswahlgröße ändern

source: Executes a lua script
de_de: Führt ein LUA-Skript aus

source: Move the cursor by keys, not by viewport mouse trace
de_de: Bewegt den Cursor mit den Tasten, nicht mit der Mausverfolgung im Ansichtsfenster

source: Change intensity by scaling the rgb values of the palette
de_de: Ändert die Intensität durch Skalierung der RGB-Werte der Palette

source: Remove unused colors from palette
de_de: Entfernt unbenutzte Farben aus der Palette

source: Apply the current palette to all model nodes
de_de: Die aktuelle Palette auf alle Knoten anwenden

source: Switch active node to hovered from scene graph mode
de_de: Wechselt den aktiven Knoten vom Szenengraph-Modus zum Hovern

source: Select all, nothing or invert
de_de: Alles auswählen, nichts oder invertieren

source: Cycle through all scene objects
de_de: Durch alle Szenenobjekte wechseln

source: Allow to align all nodes on the floor next to each other without overlapping
de_de: Ermöglicht das Ausrichten aller Knoten nebeneinander auf dem Boden, ohne sich zu überlappen

source: Save all model nodes into filenames represented by their node names
de_de: Alle Modellknoten in Dateinamen speichern, die durch ihre Knotennamen repräsentiert werden

source: Save a single node to the given path with their node names
de_de: Einen einzelnen Knoten mit ihren Knotennamen in den angegebenen Pfad speichern

source: Create a new scene (with a given name and width, height, depth - all optional)
de_de: Eine neue Szene erstellen (mit einem angegebenen Namen und Breite, Höhe, Tiefe - alle optional)

source: Crop the current active node to the voxel boundaries
de_de: Den aktuellen aktiven Knoten auf die Voxelgrenzen zuschneiden

source: Split the current active node into multiple nodes
de_de: Den aktuellen aktiven Knoten in mehrere Knoten aufteilen

source: Scale the current active node or the given node down
de_de: Den aktuellen aktiven Knoten oder den angegebenen Knoten verkleinern

source: Scale the current active node or the given node up
de_de: Den aktuellen aktiven Knoten oder den angegebenen Knoten vergrößern

source: Move the voxels of the current selected palette index or the given index into a new node
de_de: Die Voxel des aktuellen ausgewählten Palettenindex oder des angegebenen Index in einen neuen Knoten verschieben

source: Aborts the current modifier action
de_de: Bricht die aktuelle Modifier-Aktion ab

source: Fill the inner parts of closed models
de_de: Füllt die inneren Teile geschlossener Modelle

source: Remove non visible voxels
de_de: Entfernt nicht sichtbare Voxel

source: Fill voxels in the current selection
de_de: Füllt Voxel in der aktuellen Auswahl

source: Remove all voxels in the current selection
de_de: Entfernt alle Voxel in der aktuellen Auswahl

source: Set the reference position to the specified position
de_de: Setzt die Referenzposition auf die angegebene Position

source: Move the cursor by the specified offsets
de_de: Verschiebt den Cursor um die angegebenen Versätze

source: Change the normal palette
de_de: Ändert die Normalen Palette

source: Load a palette by name. E.g. 'built-in:nippon' or 'lospec:id'
de_de: Lädt eine Palette nach Namen. Z.B. 'built-in:nippon' oder 'lospec:id'

source: Set the cursor to the specified position
de_de: Setzt den Cursor auf die angegebene Position

source: Set the reference position to the current cursor position
de_de: Setzt die Referenzposition auf die aktuelle Cursorposition

source: Resize your volume about given x, y and z size
de_de: Ändert die Größe des Volumens entsprechend der angegebenen x-, y- und z-Größe

source: Resize your current model node about given x, y and z size
de_de: Ändert die Größe des aktuellen Modellknotens entsprechend der angegebenen x-, y- und z-Größe

source: Shift the volume by the given values
de_de: Verschiebt das Volumen um die angegebenen Werte

source: Center the current active nodes at the reference position
de_de: Zentriert die aktuellen aktiven Knoten auf der Referenzposition

source: Center the current active nodes at the origin
de_de: Zentriert die aktuellen aktiven Knoten am Ursprung

source: Move the voxels inside the volume by the given values without changing the volume bounds
de_de: Verschiebt die Voxel innerhalb des Volumens um die angegebenen Werte, ohne die Volumengrenzen zu ändern

source: Copy selection
de_de: Auswahl kopieren

source: Paste clipboard to current selection or reference position
de_de: Fügt die Zwischenablage in die aktuelle Auswahl oder die Referenzposition ein

source: Paste clipboard to current cursor position
de_de: Fügt die Zwischenablage an der aktuellen Cursorposition ein

source: Paste clipboard as a new node
de_de: Fügt die Zwischenablage als neuen Knoten ein

source: Cut selection
de_de: Auswahl ausschneiden

source: Undo your last step
de_de: Macht den letzten Schritt rückgängig

source: Redo your last step
de_de: Wiederholt den letzten Schritt
