Repository: vengi-voxel/vengi
Catalog: data/shared/*.po
Languages: de_de

source: Rotate active nodes around the given axis
de_de: Rotiert aktive Knoten um die angegebene Achse

source: Merge two given nodes or active model node with the next one
de_de: Führt zwei angegebene Knoten oder den aktiven Modellknoten mit dem nächsten zusammen

source: Merge all nodes
de_de: Alle Knoten zusammenführen

source: Merge all visible nodes
de_de: Alle sichtbaren Knoten zusammenführen

source: Merge all locked nodes
de_de: Alle gesperrten Knoten zusammenführen

source: Animate all nodes with the given delay in millis between the frames
de_de: Animiert alle Knoten mit der angegebenen Verzögerung in Millisekunden zwischen den Frames

source: Use the given index to select the color from the current palette
de_de: Verwendet den angegebenen Index, um die Farbe aus der aktuellen Palette auszuwählen

source: Set the current selected color by finding the closest rgb match in the palette
de_de: Setzt die aktuell ausgewählte Farbe, indem der nächstgelegene RGB-Wert in der Palette gefunden wird

source: Pick the current selected color from current cursor voxel
de_de: Wählt die aktuell ausgewählte Farbe aus dem aktuellen Cursor-Voxel aus

source: Flip the selected nodes around the given axis
de_de: Kippt die ausgewählten Knoten um die angegebene Achse

source: Add a new model node (with a given name and width, height, depth - all optional)
de_de: Fügt einen neuen Modellknoten hinzu (mit einem angegebenen Namen und Breite, Höhe, Tiefe - alle optional)

source: Delete a particular node by id - or the current active one
de_de: Löscht einen bestimmten Knoten anhand der ID - oder den aktuellen aktiven Knoten

source: Lock a particular node by id - or the current active one
de_de: Sperrt einen bestimmten Knoten anhand der ID - oder den aktuellen aktiven Knoten

source: Toggle the lock state of a particular node by id - or the current active one
de_de: Schaltet den Sperrzustand eines bestimmten Knotens anhand der ID - oder den aktuellen aktiven Knoten um

source: Unlock a particular node by id - or the current active one
de_de: Entsperrt einen bestimmten Knoten anhand der ID - oder den aktuellen aktiven Knoten

source: Set or print the current active node
de_de: Setzt oder gibt den aktuellen aktiven Knoten aus

source: Toggle the visible state of a node
de_de: Schaltet den Sichtbarkeitszustand eines Knotens um

source: Show all nodes
de_de: Alle Knoten anzeigen

source: Hide all nodes
de_de: Alle Knoten ausblenden

source: Show all children nodes
de_de: Alle Kindknoten anzeigen

source: Hide all children nodes
de_de: Alle Kindknoten ausblenden

source: Hide all model nodes except the active one
de_de: Alle Modellknoten außer dem aktiven ausblenden

source: Lock all nodes
de_de: Alle Knoten sperren

source: Unlock all nodes
de_de: Alle Knoten entsperren

source: Rename the current node or the given node id
de_de: Bennene den aktuellen Knoten oder die angegebene Knoten-ID um

source: Duplicates the current node or the given node id
de_de: Dupliziert den aktuellen Knoten oder die angegebene Knoten-ID

source: Create a node reference for the given node id
de_de: Erstellt eine Knotenreferenz für die angegebene Knoten-ID

source: Unreference from model and allow to edit the voxels for this node
de_de: Entfernt die Referenz zum Modell und ermöglicht das Bearbeiten der Voxel für diesen Knoten

source: Change the modifier type to 'select'
de_de: Ändert den Modifier-Typ auf 'Auswählen'

source: Change the modifier type to 'color picker'
de_de: Ändert den Modifier-Typ auf 'Farbauswahl'

source: Change the modifier type to 'erase'
de_de: Ändert den Modifier-Typ auf 'Löschen'

source: Change the modifier type to 'place'
de_de: Ändert den Modifier-Typ auf 'Platzieren'

source: Change the modifier type to 'override'
de_de: Ändert den Modifier-Typ auf 'Überschreiben'

source: Change the brush type to '%s'
de_de: Ändert den Pinseltyp auf '%s'

source: Change the brush type to 'none'
de_de: Ändert den Pinseltyp auf 'keiner'

source: Toggle locked mode for the given axis at the current cursor position
de_de: Schaltet den gesperrten Modus für die angegebene Achse an der aktuellen Cursorposition um

source: Toggle locked mode for the x axis at the current cursor position
de_de: Schaltet den gesperrten Modus für die X-Achse an der aktuellen Cursorposition um

source: Toggle locked mode for the y axis at the current cursor position
de_de: Schaltet den gesperrten Modus für die Y-Achse an der aktuellen Cursorposition um

source: Toggle locked mode for the z axis at the current cursor position
de_de: Schaltet den gesperrten Modus für die Z-Achse an der aktuellen Cursorposition um

source: Set center plane building
de_de: Setzt den Bau des Zentrumsplans

source: Set default aabb voxel building mode
de_de: Setzt den Standard-AABB-Voxel-Bau-Modus

source: Set single voxel building mode - continue setting voxels until you release the action button
de_de: Setzt den Einzel-Voxel-Bau-Modus - setzen Sie Voxel fort, bis Sie die Aktionstaste loslassen

source: Set single voxel building mode - continue setting voxels until you release the action button - but don't overwrite the last voxel
de_de: Setzt den Einzel-Voxel-Bau-Modus - setzen Sie Voxel fort, bis Sie die Aktionstaste loslassen - ohne Überschreiben des letzten Voxels

source: Mirror along the x axis at the reference position
de_de: Spiegelt entlang der X-Achse an der Referenzposition

source: Mirror along the y axis at the reference position
de_de: Spiegelt entlang der Y-Achse an der Referenzposition

source: Mirror along the z axis at the reference position
de_de: Spiegelt entlang der Z-Achse an der Referenzposition

source: Disable mirror axis
de_de: Deaktiviert die Spiegelachse

source: Change the modifier shape type
de_de: Ändert den Modifier-Formtyp

source: Brighten
de_de: Aufhellen

source: Darken
de_de: Abdunkeln

source: Random
de_de: Zufällig

source: Toggle center at cursor
de_de: Schaltet das Zentrum am Cursor um

source: Toggle continuously placing the stamp voxels
de_de: Schaltet das kontinuierliche Platzieren der Stempel-Voxel um

source: Rotate stamp volume around the given axis by 90 degrees
de_de: Rotiert Stempel um 90 Grad um die angegebene Achse

source: Use the current selection as new stamp
de_de: Die aktuelle Auswahl als neuen Stempel verwenden

source: Use the current selected node volume as new stamp
de_de: Den aktuellen Knoten als neuen Stempel verwenden

source: Paste the current clipboard content as stamp
de_de: Die Zwischenablage als neuen Stempel verwenden

source: No stamp volume set
de_de: Kein Stempel gesetzt

source: Change the text brush axis
de_de: Ändere die Achse des Textpinsels

source: No image loaded for texture brush
de_de: Kein Bild für den Texturenpinsel geladen

source: Reset the uv coordinates
de_de: Zurücksetzen der Texturkoordinaten
