Repository: vengi-voxel/vengi
Catalog: data/shared/*.po
Languages: de_de

source: The language to use - empty means system default
de_de: Die zu verwendende Sprache - leer bedeutet Systemstandard

source: The lower the value, the more you see. 1 is the highest log level, 5 is just fatal errors.
de_de: Je niedriger der Wert, desto mehr sehen Sie. 1 ist das höchste Protokollniveau, 5 sind nur schwerwiegende Fehler.

source: Print the version and quit
de_de: Die Version anzeigen und beenden

source: Print this help and quit
de_de: Diese Hilfe anzeigen und beenden

source: Generate completion for bash and zsh
de_de: Vervollständigung für Bash und ZSH generieren

source: Change log level from 1 (trace) to 6 (only critical)
de_de: Protokollniveau von 1 (Trace) auf 6 (nur kritisch) ändern

source: Set a variable value
de_de: Einen Variablenwert setzen

source: Clear the variable value
de_de: Einen Variablenwert löschen

source: Quit the application
de_de: Die Anwendung beenden

source: Trigger an assert
de_de: Einen Fehler provozieren

source: Clear the value history of a variable
de_de: Den Verlauf des Variablenwerts löschen

source: Just a no-operation command
de_de: Nur ein Befehl ohne Operation

source: Open the given url in a browser
de_de: Die angegebene URL in einem Browser öffnen

source: Print the given arguments to the console (info log level)
de_de: Die angegebenen Argumente auf der Konsole ausgeben (Info-Protokollniveau)

source: Execute a file with script commands
de_de: Eine Datei mit Skriptbefehlen ausführen

source: Toggle between true/false for a variable
de_de: Umschalten zwischen true/false für eine Variable

source: Increase a cvar value by the given value (default: 1)
de_de: Den Wert einer cvar um den angegebenen Wert erhöhen (Standard: 1)

source: Decrease a cvar value by the given value (default: 1)
de_de: Den Wert einer cvar um den angegebenen Wert verringern (Standard: 1)

source: Show the value of a variable
de_de: Den Wert einer Variable anzeigen

source: Print current milliseconds to console
de_de: Aktuelle Millisekunden auf der Konsole ausgeben

source: Log given message as error
de_de: Die angegebene Nachricht als Fehler protokollieren

source: Log given message as info
de_de: Die angegebene Nachricht als Info protokollieren

source: Log given message as debug
de_de: Die angegebene Nachricht als Debug protokollieren

source: Log given message as warn
de_de: Die angegebene Nachricht als Warnung protokollieren

source: Show the list of known variables (wildcards supported)
de_de: Die Liste der bekannten Variablen anzeigen (Platzhalter unterstützt)

source: Show the list of known commands (wildcards supported)
de_de: Die Liste der bekannten Befehle anzeigen (Platzhalter unterstützt)

source: Camera free look on toggle
de_de: Kamera-Freisicht umschalten

source: Toggle relative mouse rotation mode
de_de: Relativen Maus-Rotationsmodus umschalten

source: Show all commands
de_de: Alle Befehle anzeigen

source: Show all cvars
de_de: Alle cvars anzeigen

source: Documents
de_de: Dokumente

source: Download
de_de: Herunterladen

source: Fonts
de_de: Schriftarten

source: Pictures
de_de: Bilder

source: Public
de_de: Öffentlich

source: Recent
de_de: Zuletzt

source: Quick Access
de_de: Schnellzugriff

source: This PC
de_de: Dieser PC

source: Bookmarks
de_de: Lesezeichen

source: Remove bookmark
de_de: Lesezeichen entfernen

source: File
de_de: Datei

source: Size
de_de: Größe

source: Type
de_de: Typ

source: Date
de_de: Datum

source: directory
de_de: Verzeichnis

source: Add a bookmark for the current active folder
de_de: Ein Lesezeichen für den aktuellen aktiven Ordner hinzufügen

source: Show hidden file system entities
de_de: Versteckte Dateisystem-Entitäten anzeigen

source: The last selected file type filter in the file dialog
de_de: Der zuletzt ausgewählte Dateitypfilter im Dateidialog

source: Create folder
de_de: Ordner erstellen

source: Enter a name for the new folder
de_de: Geben Sie einen Namen für den neuen Ordner ein

source: Create
de_de: Erstellen

source: Folder name can't be empty
de_de: Der Ordnername darf nicht leer sein

source: Options
de_de: Optionen

source: File already exists
de_de: Datei existiert bereits

source: %s already exist. Do you want to overwrite the file?
de_de: %s existiert bereits. Möchten Sie die Datei überschreiben?

source: Save file
de_de: Datei speichern

source: Select a directory
de_de: Ein Verzeichnis auswählen

source: Select a file
de_de: Eine Datei auswählen

source: New folder
de_de: Neuer Ordner

source: Filename
de_de: Dateiname

source: Show hidden
de_de: Versteckte anzeigen

source: Choose
de_de: Auswählen

source: Open
de_de: Öffnen

source: Save
de_de: Speichern

source: Error: You must select a folder!
de_de: Fehler: Sie müssen einen Ordner auswählen!

source: Error: You must select a file!
de_de: Fehler: Sie müssen eine Datei auswählen!

source: Error: You must select a file type!
de_de: Fehler: Sie müssen einen Dateitypen auswählen!

source: Change the ui colors - [0-3]
de_de: Die UI-Farben ändern - [0-3]

source: Timeout for notifications in millis
de_de: Timeout für Benachrichtigungen in Millisekunden

source: Allow multi monitor setups - requires a restart
de_de: Mehrere Monitor-Setups zulassen - erfordert einen Neustart

source: Render the ui
de_de: Das UI rendern

source: Show metric and debug window
de_de: Metrik- und Debug-Fenster anzeigen

source: Allow to change the ui font size
de_de: Ändern der UI-Schriftgröße zulassen

source: Which keybinding to use
de_de: Welche Tastaturbelegung verwenden

source: Bindings
de_de: Tastenbelegungen

source: Keys
de_de: Tasten

source: Command
de_de: Befehl

source: Context
de_de: Beschreibung

source: Description
de_de: Beschreibung

source: Failed to get command for %s
de_de: Fehler beim Abrufen des Befehls für %s

source: Reset to default
de_de: Auf Standard zurücksetzen

source: Configuration variables
de_de: Konfigurationsvariablen

source: Value
de_de: Wert

source: Reset
de_de: Zurücksetzen

source: Reset to default value
de_de: Auf Standardwert zurücksetzen

source: Close
de_de: Schließen

source: Commands
de_de: Befehle

source: Textures
de_de: Texturen

source: Recently opened
de_de: Zuletzt geöffnet

source: Size column to fit###SizeOne
de_de: Spalte anpassen###SizeOne

source: Size all columns to fit###SizeAll
de_de: Alle Spalten anpassen###SizeAll

source: Size all columns to default###SizeAll
de_de: Alle Spalten auf Standardgröße###SizeAll

source: Reset order###ResetOrder
de_de: Reihenfolge zurücksetzen###ResetOrder

source: (Main menu bar)
de_de: (Hauptmenüleiste)

source: (Untitled)
de_de: (Unbenannt)

source: Open '%s'
de_de: Öffne '%s'

source: Copy Link###CopyLink
de_de: Link kopieren###CopyLink

source: Hide tab bar###HideTabBar
de_de: Tab-Leiste ausblenden###HideTabBar

source: Hold SHIFT to enable Docking window.
de_de: SHIFT gedrückt halten, um das Docking-Fenster zu aktivieren.

source: Click and drag to move or undock whole node.
de_de: Klicken und ziehen, um den gesamten Knoten zu verschieben oder zu lösen.

source: Language
de_de: Sprache

source: To change the language everywhere restart the application
de_de: Um die Sprache überall zu ändern, muss die Applikation neu gestartet werden

source: Keymap
de_de: Tastaturbelegung

source: Color reduction
de_de: Farbreduktion

source: The color reduction algorithm that is used when importing RGBA colors from images or rgba formats
de_de: Der Farbreduktionsalgorithmus, der beim Importieren von RGBA-Farben aus Bildern oder RGBA-Formaten verwendet wird

source: Clear
de_de: Löschen

source: Copy
de_de: Kopieren

source: Enable debug logging for the console
de_de: Debug-Protokollierung für die Konsole aktivieren

source: Auto scrolling
de_de: Automatisches Scrollen

source: Cancel
de_de: Abbrechen

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Open in browser %s
de_de: Im Browser öffnen %s

source: Enable sending anonymous metrics
de_de: Senden anonymer Metriken aktivieren

source: Send anonymous usage statistics
de_de: Anonyme Nutzungsstatistiken senden

source: About
de_de: Über

source: This is a beta release!
de_de: Dies ist eine Beta-Version!

source: A new version is available!
de_de: Eine neue Version ist verfügbar!

source: You are using the latest version.
de_de: Sie verwenden die neueste Version.

source: Bug reports
de_de: Fehlerberichte

source: Help
de_de: Hilfe

source: Credits
de_de: Danksagungen

source: Paths
de_de: Pfade

source: Clear the text from the built-in console
de_de: Den Text aus der integrierten Konsole löschen

source: Print the command history
de_de: Die Befehlshistorie anzeigen

source: Show all known key bindings
de_de: Alle bekannten Tastaturbelegungen anzeigen

source: Bind a command to a key
de_de: Einen Befehl an eine Taste binden

source: Unbind a key
de_de: Eine Taste entbinden

source: Show all images in the texture pool
de_de: Alle Bilder im Texturpool anzeigen

source: Activate shadow map
de_de: Aktivieren des Schattenrenderings

source: Activate checkerboard rendering
de_de: Schachbrett-Rendering aktivieren

source: Activate bloom post processing
de_de: Bloom-Nachbearbeitung aktivieren

source: Activate shadow debug rendering
de_de: Schatten-Debug-Rendering aktivieren

source: Activate cascade shadow map debug rendering
de_de: Debug-Rendering für kaskadierende Schattenkarte aktivieren

source: Gamma correction
de_de: Gammakorrektur

source: Render voxel outline
de_de: Voxel-Umriss rendern

source: Render voxel normals
de_de: Voxelnormalen rendern

source: Activate tone mapping
de_de: Tone mapping aktivieren

source: Limit the framerate to the monitor refresh rate
de_de: Begrenze die Bildrate auf die Bildwiederholfrequenz des Monitors

source: 0 disables it, 1 only highest severity, 2 medium severity, 3 everything
de_de: 0 deaktiviert es, 1 nur höchste Schwere, 2 mittlere Schwere, 3 alles

source: Minimize the window
de_de: Das Fenster minimieren

source: Apply transforms to Minecraft skins
de_de: Transformationen bei Minecraft Skins anwenden

source: Draw line forwards
de_de: Linie nach vorne zeichnen

source: Set voxel type
de_de: Voxeltyp festlegen

source: Move backwards (no drawing)
de_de: Rückwärts bewegen (kein Zeichnen)

source: Leaf
de_de: Blatt

source: Rotate right
de_de: Nach rechts drehen

source: Rotate left
de_de: Nach links drehen

source: Rotate forward
de_de: Nach vorne drehen

source: Rotate back
de_de: Nach hinten drehen

source: Increment width
de_de: Breite erhöhen

source: Decrement width
de_de: Breite verringern

source: Push
de_de: Drücken

source: Pop
de_de: Herausnehmen

source: Bottom
de_de: Unten

source: Free
de_de: Frei

source: Left
de_de: Links

source: Top
de_de: Oben

source: Back
de_de: Rückseite

source: Right
de_de: Rechts

source: 6 bit colors
de_de: 6-Bit Farbwerte

source: Uniform scale
de_de: Gleichmäßige Skalierung

source: X axis scale
de_de: X-Achsen-Skalierung

source: Y axis scale
de_de: Y-Achsen-Skalierung

source: Z axis scale
de_de: Z-Achsen-Skalierung

source: Heightmap
de_de: Höhenkarte

source: Plane
de_de: Ebene

source: Thumbnail
de_de: Miniaturansicht

source: Volume
de_de: Volumen

source: Image mode
de_de: Bildmodus

source: Layer information
de_de: Ebeneninformationen

source: Merge quads
de_de: Quads zusammenführen

source: Reuse vertices
de_de: Vertices wiederverwenden

source: Apply transformations
de_de: Transformationen anwenden

source: Apply optimizations
de_de: Optimierungen anwenden

source: Exports quads
de_de: Quads exportieren

source: Vertex colors
de_de: Vertexfarben

source: Normals
de_de: Normalen

source: Vertex colors as float
de_de: Vertexfarben als Fließkommazahlen

source: Texture coordinates
de_de: Texturkoordinaten

source: Export materials
de_de: Materialien exportieren

source: Binvox 1 (white)
de_de: Binvox 1 (weiß)

source: Binvox 2 (multi colors)
de_de: Binvox 2 (Mehrfarbig)

source: Binvox 3 (unofficial)
de_de: Binvox 3 (inoffiziell)

source: Single object
de_de: Einzelnes Objekt

source: Save visible only
de_de: Nur sichtbares speichern

source: Palette mode
de_de: Palettenmodus

source: Merge compounds
de_de: Verbindungen zusammenführen

source: Create groups
de_de: Gruppen erstellen

source: Create layers
de_de: Ebenen erstellen

source: Left handed
de_de: Linkshändig

source: Compressed
de_de: Komprimiert

source: Empty palette index
de_de: Leerer Paletteneintrag

source: Max depth
de_de: Max. Tiefe

source: Both sides
de_de: Beide Seiten

source: Min height
de_de: Mindesthöhe

source: Texture search path
de_de: Texturensuchpfad

source: Fill hollow
de_de: Hohlraum füllen

source: Point cloud size
de_de: Punktwolkengröße

source: Simplify
de_de: Vereinfachen

source: faster and less memory
de_de: schneller und weniger Speicher

source: high quality
de_de: hohe Qualität

source: Voxelization mode
de_de: Voxelisierungsmodus

source: RGB weighted average
de_de: RGB gewichteter Durchschnitt

source: RGB flatten factor
de_de: RGB-Abflachfaktor

source: Create palette
de_de: Palette erstellen

source: Map colors to palette
de_de: Mappe Farben auf Palette

source: Max image size
de_de: Maximale Bildgröße

source: Add groups
de_de: Gruppen hinzufügen

source: Merge faces
de_de: Seiten zusammenführen

source: Load HVA
de_de: HVA laden

source: Cubes
de_de: Würfel

source: Mesh mode
de_de: Mesh-Modus

source: Script parameters
de_de: Skriptparameter

source: LUA scripts for manipulating the voxel volumes
de_de: LUA-Skripte zur Manipulation der Voxelvolumen

source: Run
de_de: Ausführen

source: Execute the selected script for the currently loaded voxel volumes
de_de: Das ausgewählte Skript für die aktuell geladenen Voxelvolumen ausführen

source: Quit
de_de: Beenden

source: Edit
de_de: Bearbeiten

source: Allow multi monitor
de_de: Mehrere Monitore zulassen

source: Font size
de_de: Schriftgröße

source: Dark
de_de: Dunkel

source: Classic
de_de: Klassisch

source: Light
de_de: Hell

source: Color theme
de_de: Farbthema

source: Notifications
de_de: Benachrichtigungen

source: Show console
de_de: Konsole anzeigen

source: Overwrite existing output file
de_de: Überschreibe existierende Zieldatei

source: Input options
de_de: Quelloptionen

source: Output options
de_de: Zieloptionen

source: Script options
de_de: Skriptoptionen

source: Convert
de_de: Konvertieren

source: Found vengi-voxconvert at %s
de_de: vengi-voxconvert unter %s gefunden

source: Open output file
de_de: Öffne Zieldatei

source: Save the current viewport as screenshot
de_de: Den aktuellen Ansichtsbereich als Screenshot speichern

source: Toggle scene mode on/off
de_de: Szenenmodus ein-/ausschalten

source: Save the current scene to the given file
de_de: Die aktuelle Szene als Volumen in die angegebene Datei speichern

source: Save the selection from the current active model node
de_de: Die Auswahl aus dem aktuellen aktiven Modellknoten speichern

source: Load a scene from the given volume file
de_de: Eine Szene aus der angegebenen Volumendatei laden

source: Add a volume to the existing scene from the given file
de_de: Ein Volumen zur vorhandenen Szene aus der angegebenen Datei hinzufügen

source: Import all files from a given directory
de_de: Alle Dateien aus einem angegebenen Verzeichnis importieren

source: Import an image as a palette
de_de: Ein Bild als Palette importieren

source: Create a new scene with ui interaction
de_de: Eine neue Szene mit UI-Interaktion erstellen

source: Reset cameras in viewports
de_de: Kameras in den Ansichtsbereichen zurücksetzen

source: Create animation
de_de: Animation erzeugen

source: Animation already exists
de_de: Animation existiert bereits

source: Add new animation
de_de: Neue Animation hinzufügen

source: Delete
de_de: Löschen

source: Add
de_de: Hinzufügen

source: Add a new keyframe to the current active node
de_de: Ein neues Keyframe zum aktuell aktiven Knoten hinzufügen

source: Add all
de_de: Alle hinzufügen

source: Add a new keyframe to all nodes
de_de: Ein neues Keyframe zu allen Knoten hinzufügen

source: Delete the current keyframe of the active nodes
de_de: Das aktuelle Keyframe der aktiven Knoten löschen

source: Crop frames
de_de: Bilder zuschneiden

source: Max frames for this animation: %i
de_de: Maximale Anzahl von Bildern für diese Animation: %i

source: Loop
de_de: Schleife

source: Paste
de_de: Einfügen

source: Duplicate keyframe
de_de: Keyframe duplizieren

source: Delete keyframes
de_de: Keyframes löschen

source: Delete %i keyframes
de_de: %i Keyframes löschen

source: Assets
de_de: Ressourcen

source: Models
de_de: Modelle

source: Images
de_de: Bilder

source: Shape
de_de: Form

source: Disable mirror
de_de: Spiegelung deaktivieren

source: Use selection
de_de: Auswahl verwenden

source: Model
de_de: Modell

source: Select a model from the asset panel or scene graph panel
de_de: Ein Modell aus dem Asset-Panel oder dem Szenegraph-Panel auswählen

source: Center
de_de: Zentriert

source: Continuous
de_de: Kontinuierlich

source: Replace
de_de: Ersetzen

source: Replace all voxels in the stamp with the selected color
de_de: Alle Voxel im Stempel mit der ausgewählten Farbe ersetzen

source: Rotate on axis
de_de: Um Achse rotieren

source: Reduce size
de_de: Größe reduzieren

source: Extrude voxels
de_de: Voxel extrudieren

source: Erase voxels
de_de: Voxel löschen

source: Override voxels
de_de: Voxel überschreiben

source: Draws a line from the reference position to the current cursor position
de_de: Zeichnet eine Linie von der Referenzposition zur aktuellen Cursorposition

source: Unselect
de_de: Auswahl entfernen

source: Mode
de_de: Modus

source: None
de_de: Keine

source: Project onto surface
de_de: Auf Oberfläche projezieren

source: 18-connected
de_de: 18-verbunden

source: 26-connected
de_de: 26-verbunden

source: 6-connected
de_de: 6-verbunden

source: Connectivity
de_de: Konnektivität

source: Draws a path over existing voxels
de_de: Zeichnet einen Pfad über vorhandene Voxel

source: Convert palette
de_de: Palette konvertieren

source: Default
de_de: Standard

source: Single
de_de: Einzeln

source: Single Move
de_de: Einzeln Bewegung

source: Use a radius around the current voxel - 0 for spanning a region
de_de: Verwende einen Radius um den aktuellen Voxel - 0 um eine Region zu umspannen

source: Clamping
de_de: Begrenzung

source: Clamp the brush to the volume
de_de: Den Pinsel auf das Volumen begrenzen

source: Horizontal spacing
de_de: Horizontaler Abstand

source: Thickness
de_de: Dicke

source: Font
de_de: Schriftart

source: Factor
de_de: Faktor

source: Variation threshold
de_de: Variationsschwelle

source: Paint the selected plane
de_de: Die ausgewählte Ebene bemalen

source: Gradient
de_de: Verlauf

source: Brush settings
de_de: Pinsel-Einstellungen

source: Click on a voxel to pick the color
de_de: Klicken Sie auf einen Voxel, um die Farbe auszuwählen

source: Brush
de_de: Pinsel

source: Add new camera
de_de: Neue Kamera hinzufügen

source: Camera rotation
de_de: Kamerarotation

source: Eye
de_de: Auge

source: Target
de_de: Ziel

source: Camera movement
de_de: Kamerabewegung

source: Perspective
de_de: Perspektive

source: Camera
de_de: Kamera

source: Target distance
de_de: Entfernung zum Ziel

source: Aspect ratio
de_de: Seitenverhältnis

source: License
de_de: Lizenz

source: Local directory
de_de: Lokales Verzeichnis

source: Loading...
de_de: Laden...

source: Double click to load
de_de: Doppelklick zum Laden

source: Use stamp
de_de: Stempel verwenden

source: This is only possible if the model doesn't exceed the max allowed stamp size
de_de: Dies ist nur möglich, wenn das Modell die maximale erlaubte Stempelgröße nicht überschreitet

source: Add to scene
de_de: Zur Szene hinzufügen

source: Hide thumbnails
de_de: Miniaturansicht verstecken

source: Show thumbnails
de_de: Miniaturansicht anzeigen

source: Open target file
de_de: Öffne Zieldatei

source: Open target dir
de_de: Öffne Zielverzeichnis

source: Create thumbnail
de_de: Miniaturansicht erzeugen

source: Double click to create thumbnail
de_de: Doppelklick zum Erstellen der Miniaturansicht

source: No match for filter found
de_de: Keine Übereinstimmung für den Filter gefunden

source: Game mode
de_de: Spielmodus

source: Body Height
de_de: Körperhöhe

source: Friction
de_de: Reibung

source: Body Size
de_de: Körpergröße

source: Rules
de_de: Regeln

source: Action
de_de: Aktion

source: Add Rule
de_de: Regel hinzufügen

source: Angle
de_de: Winkel

source: Length
de_de: Länge

source: Width
de_de: Breite

source: Width increment
de_de: Breiteninkrement

source: Iterations
de_de: Iterationen

source: Leaves radius
de_de: Blattradius

source: Templates
de_de: Vorlagen

source: Select a template
de_de: Wähle die Vorlage aus

source: Adopt Dimensions
de_de: Dimensionen anpassen

source: Tip of the day
de_de: Tipp des Tages

source: Show again
de_de: Erneut anzeigen

source: Next
de_de: Weiter

source: Color
de_de: Farbe

source: Welcome
de_de: Willkommen

source: Welcome to VoxEdit!
de_de: Willkommen bei VoxEdit!

source: The mission: Create a free, open-source and multi-platform voxel editor with animation support for artists and developers.
de_de: Die Mission: Bereitstellen eines kostenlosen, Open-Source- und plattformübergreifenden Voxel-Editors mit Animationsunterstützung für Voxelkünstler und Entwickler.

source: We would like to enable anonymous usage metrics to improve the editor. Please consider enabling it.
de_de: Wir würden gerne anonyme Nutzungsstatistiken aktivieren, um den Editor zu verbessern. Bitte aktivieren Sie es um uns zu unterstützen.

source: Unreference Model
de_de: Referenz auflösen

source: You can't edit a model reference. Do you want to convert the reference into a model?
de_de: Sie können eine Modellreferenz nicht bearbeiten. Möchten Sie die Referenz in ein Modell umwandeln?

source: New Scene
de_de: Neue Szene

source: Empty scene
de_de: Leere Szene

source: Height
de_de: Höhe

source: Depth
de_de: Tiefe

source: Failed to save
de_de: Fehler beim Speichern

source: Failed to save the model!
de_de: Fehler beim Speichern des Modells!

source: Unsaved Changes
de_de: Ungespeicherte Änderungen

source: Unsaved changes - are you sure to quit?
de_de: Ungespeicherte Änderungen - Möchten Sie wirklich beenden?

source: Unsaved Modifications
de_de: Nicht gespeicherte Änderungen

source: There are unsaved modifications. Do you wish to discard them?
de_de: Es gibt ungespeicherte Änderungen. Möchten Sie sie verwerfen?

source: Volume split
de_de: Volumen teilen

source: Some model volumes are too big for optimal performance. It's encouraged to split them into smaller volumes. Do you wish to split them now?
de_de: Einige Modellvolumen sind für eine optimale Leistung zu groß. Es wird empfohlen, sie in kleinere Volumen aufzuteilen. Möchten Sie sie jetzt aufteilen?

source: Model settings
de_de: Modell-Einstellungen

source: Rename node
de_de: Knoten Umbenennen

source: Node names should be unique
de_de: Knotennamen sollten eindeutig sein

source: Apply
de_de: Anwenden

source: Formats
de_de: Formate

source: Voxel load
de_de: Voxel laden

source: Extension
de_de: Erweiterung

source: Voxel save
de_de: Voxel speichern

source: Palettes
de_de: Paletten

source: History
de_de: Verlauf

source: Current state: %i / %i
de_de: Aktueller Zustand: %i / %i

source: Grid
de_de: Raster

source: Show gizmo
de_de: Gizmo anzeigen

source: Show locked axis
de_de: Gesperrte Achse anzeigen

source: Bounding box
de_de: Begrenzungsrahmen

source: Plane size
de_de: Ebenengröße

source: Outlines
de_de: Umrisslinien

source: Shadows
de_de: Schatten

source: View mode
de_de: Oberflächenmodus

source: New
de_de: Neu

source: Load
de_de: Öffnen

source: Save as
de_de: Speichern unter

source: Save selection
de_de: Auswahl speichern

source: Add file to scene
de_de: Datei zur Szene hinzufügen

source: Add directory to scene
de_de: Verzeichnis zur Szene hinzufügen

source: Undo
de_de: Rückgängig
